CROPPER_PATH = './models/best_yolo26s.pt'
CROPPER_TRESHOLD = 0.7

MAX_CANDIDATES = 30
TOP_K_SEARCH = 5
SEARCH_SCORE_TRESHOLD = 0.6

LOCAL_LLM_PATH = "http://localhost:8000/v1"
# Можно вынести в другой файл и менять не залезая в код
SYSTEM_PROMPT = (
               """ Ты — высокоточный движок оптического распознавания символов (OCR). 
                Твоя задача — извлекать структурированную информацию из этикетки вина 
                Отвечай СТРОГО в формате валидного JSON. 
                Ты должен извлекать ключевую информацию о вине
                Пример json схемы для ответа:
                {
                    wine_name: 'название вина',
                    producer: 'производитель вина',
                    grape_varieties: ["типы винограда"],
                    color: "Белое" или "Красное" или "Розовое",
                    category: "Сухое" или "Полусухое" или "Полусладкое" или "Сладкое",
                    region: 'регион производства',
                    }
                Не добавляй никаких пояснений до или после JSON. 
                Не ставь метки формата данных. Только сам словарь 
                Ты должен вставлять ключевую информация строго из текста
                СТРОГО ЗАПРЕЩЕНО: добавлять комментарии, исправлять ошибки, интерпретировать текст, 
                добавлять приветствия или пояснения. Выводи ТОЛЬКО сырой текст с картинки,
                """
            )

USER_PROMPT = "Буквально считай весь текст с этикетки этой бутылки. Возьми сорта винограда, регион, цыет вина, сухость вина, год."
TEMPERATURE = 0.3
TOP_P = 0.8